
Процедура ОбработкаПроведения(Отказ, Режим)
	//получение учетной политики
	МетодСписания = Константы.ТипОчереди.Получить();
	Средняя = МетодСписания = Перечисления.ТипОчереди.Средняя;

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		Если Не Средняя Тогда // если метод списания средняя - не следует записывать документ партия
			Движение.Партия = Ссылка;
		КонецЕсли;
		Движение.Количество = ТекСтрокаСписокНоменклатуры.Количество;
		Движение.Сумма = ТекСтрокаСписокНоменклатуры.Сумма;
	КонецЦикла;
КонецПроцедуры
